packages/api/loadtest.yaml
config:
  target: "https://plutomi.com"
  phases:
    - duration: 300
      arrivalRate: 5
      rampTo: 250
      name: "Ramp up to 1k requests per second"

    - duration: 300
      arrivalRate: 250
      name: Sustained @ 1k load

scenarios:
  - flow:
      - get:
          url: "/api/health?josetesting"
    count: 100